{
  "format": "layers-model",
  "generatedBy": "tensorflowjs_converter v3.8.0",
  "convertedBy": "TensorFlow.js v3.8.0",
  "modelTopology": {
    "class_name": "Sequential",
    "keras_version": "2.2.4-tf",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "batch_input_shape": [
              null,
              784
            ],
            "dtype": "float32",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            784,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": [
        "group2-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            256,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
